StoveSim/simulations/case_44/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    primary_inlet
    {
        type            fixedValue;
        value           uniform (0 0 10);
    }
	secondary_air_RHS
	{
		type fixedValue;
		value uniform (0 -40 0);
	}
	secondary_air_LHS
	{
		type fixedValue;
		value uniform (0 40 0);
	}
    outlet_LHS
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	outlet_RHS
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    stove_body
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
